[
  {
    "year": 2025,
    "title": "Optimistic Constrained Online Convex Optimization for Resource Reservation in Tactile Internet",
    "authors": "Yu Yeh, Vineeth S Varma, Salah E Elayoubi",
    "venue": "IEEE Globecom 2025",
    "abstract": "Tactile Internet has emerged as a cutting-edge application in 5G, aligning with requirements of Ultra-Reliable Low-Latency Communications (URLLC), and is expected to be an essential service in 6G. TI service traffic is characterized by a high burstiness, and the design of effective resource reservation strategies remains an open research in this context. To address this challenge, we formulate the resource reservation problem in the Tactile Internet as an online decision-making task and address it by applying Optimistic Constrained Online Convex Optimization, profiting from Tactile Internet traffic prediction capabilities. We validate the proposed optimistic algorithm by utilizing a traffic dataset based on a self-developed hapticvisual testbed, demonstrating the optimistic algorithm's superior performance compared to the non-optimistic baseline.",
    "links": { 
      "pdf": "#", 
      "Link": "https://hal.science/hal-05268651v1/file/2025292806_03.pdf", 
      "code": "#" 
    },
    "tags": ["Tactile Internet","Optomistic Constrained Online Convex Optimization"]
  }, 
  {
    "year": 2025,
    "title": "Data-driven Context-Aware Traffic Prediction and Modeling for Tactile Internet",
    "authors": "Y Yeh, SN Özsert, D Prattichizzo, VS Varma, SE Elayoubi",
    "venue": "European Wireless 2025",
    "abstract": "We propose a data-driven, context-aware approach for traffic modeling and a traffic predictor to support resource reservation in the tactile internet for bursty traffic patterns caused by Deadband Perceptual Data Reduction (DPDR). The traffic state is defined as the number of arriving packets in the next time window, which is modeled and predicted based on historical context information, which refers to user motion commands or haptic feedback. Since traffic prediction in this context is traditionally challenging and often limited to binary state consideration, the proposed method provides a more general framework for multi-state applications. By using a manually collected dataset from a self-developed visuo-haptic experiment setup, the proposed method provides a superior performance in terms of traffic modeling and prediction, compared to its own benchmark.",
    "links": { 
      "pdf": "#", 
      "Link": "https://hal.science/hal-05269390v1/file/EW_25_final_03.pdf", 
      "code": "#" 
    },
    "tags": ["Tactile Internet","Traffic Modeling", "Traffic Prediction", "Data-driven approach"]
  },
 
    {
      "year": 2024,
      "title": "AoI-based switching control for safe haptic teleoperation over a wireless network",
      "authors": "Yu Yeh, Vineeth S Varma, Salah E Elayoubi",
      "venue": "IEEE CDC 2024",
      "abstract": "In this paper, we propose a switching policy based on the Age of Information (AoI) to enhance safety in haptic teleoperation over a wireless network, which is a key application of interest in upcoming 6G networks. Given the unique challenges of human-in-the-loop scenarios, our focus is on safety-oriented control since imperfect transmissions could introduce safety risks in typical haptic teleoperation scenarios. We introduce an AoI-based Markov Jump Linear System (MJLS) to model the closed-loop system, considering the AoI-based safety switching policy. This policy activates a “safe” controller on the remote side when the AoI exceeds a predefined threshold. While the safe controller does not know the desired human control, it is able to bring the robot or plant to a safe state. For a given AoI-based threshold, we utilize MJLS properties to ensure closed-loop stability. We also introduce and optimize performance criteria that address safety issues as well as transparency for the human controller, i.e., how closely the system can follow the human’s intention. Numerical results demonstrate that our safe control scheme improves performance in 2D reference tracking tasks while ensuring safety and reducing undesirable behavior like overshoots.",
      "links": { 
        "pdf": "#", 
        "DOI: 10.1109/CDC56724.2024.10885873": "https://ieeexplore.ieee.org/abstract/document/10885873/", 
        "code": "#" 
      },
      "tags": ["Haptics Interface","Markov Jump Lienar System", "Safety control"]
    },
    {
      "year": 2022,
      "title": "Modeling and position control of the HASEL actuator via port-Hamiltonian approacht",
      "authors": "Yu Yeh, Nelson Eduardo Cisneros Pinto, Yongxin Wu, Kanty Rabenorosoa, Yann Le Gorreci",
      "venue": "IEEE Robotics and Automation Letters",
      "abstract": "This paper deals with the modeling and control problem of a Hydraulically Amplified Self-healing Electrostatic (HASEL) actuator based on the port-Hamiltonian framework. A nonlinear spring-damper system is used to approximate the mechanical deformation of the actuator due to the motion of the fluid while a nonlinear capacitance is used to approximate the electric behavior of the system. The actuator position control strategy is investigated based on the Interconnection Damping Assignment-Passivity Based Control (IDA-PBC) method, with further Integral Actions (IA) added to cope with load uncertainties. The proposed model and control laws are validated on an experimental benchmark. The experimental tests demonstrate that the proposed model is accurate up to 94% of fitness. The controllers allow assigning the actuator position with ramp and sinusoidal references with the relative error less than 5%. At last, the robustness of the proposed IDA-PBC controller with IA has been shown with the experimental result for the unknown load disturbance rejection.",
      "links": { 
        "pdf": "https://evanyeh5118.github.io/files/yu2022Modeling.pdf", 
        "DOI: 10.1109/LRA.2022.3181365": "https://ieeexplore.ieee.org/document/9793678/", 
        "code": "#" 
      },
      "tags": ["HASEL","Soft Actuators", "Port-Hamiltonian"]
    }
]